import SegmentationTitle from "@/components/SegmentationTitle"
import Head from "next/head"
import React, { useEffect, useState } from "react"
import ButtonComponent from "@/components/ButtonComponent"

const SegmentationPower = () => {
  const [imageClicked, setImageClicked] = useState(false)
  const [loading, setLoading] = useState(false)
  const [imageSource, setImageSource] = useState(
    "./images/segmentation__images/mobile-1.svg"
  )

  const loadImage = (imageState) => {
    setLoading(true)
    const img = new Image()
    img.src = `./images/segmentation__images/mobile-1${
      imageState ? "__click" : ""
    }.svg`
    img.onload = () => {
      setLoading(false)
      setImageSource(img.src)
    }
  }

  const imageClickHandler = () => {
    const imageState = !imageClicked
    setImageClicked(!imageClicked)
    loadImage(imageState)
  }

  return (
    <article className="useful">
      <Head>
        <title>Сегментация по характеру образа</title>
        <meta
          name="description"
          content="Распределение регионов по характеру образа в глазах туристов"
        />
        <meta property="og:title" content="Сегментация по характеру образа" />
        <meta
          property="og:description"
          content="Распределение регионов по характеру образа в глазах туристов"
        />
        <meta
          property="og:url"
          content="https://tourism-index.strelka-kb.com/segmentationpower"
        />
        <meta name="twitter:card" content="summary_large_image" />
      </Head>
      <h1 className="calculated__title">Сегментация по характеру образа</h1>
      <div
        className={"segmentation__image-container"}
        onClick={imageClickHandler}
      >
        {imageClicked ? (
          <></>
        ) : (
          <img
            className={"segmentation__image-zoom"}
            src={"./images/segmentation__images/zoom-circle.svg"}
            alt={"Увеличить"}
          />
        )}
        <img
          className="useful__image segmentation__image"
          src={`./images/segmentation__images/1${
            imageClicked ? "__click" : ""
          }.jpg`}
          alt="Сегментация по характеру образа"
        />
      </div>
      <div className="segmentation__image-mobile">
        <h2 className="segmentation__image-mobile-title">
          Распределение регионов по характеру образа в глазах туристов
        </h2>
        <div className="rating__scroll-warning">
          <img
            className="rating__scroll-image"
            alt="Перемещайте схему горизонтально"
            src="./images/scroll-img.svg"
          />
          <p className="rating__scroll-text">Перемещайте схему горизонтально</p>
        </div>
        <p className="segmentation__mobile-warning">
          {imageClicked
            ? "Нажмите, чтобы уменьшить изображение"
            : "Нажмите, чтобы увеличить изображение"}
        </p>
        <div
          className={"segmentation__mobile-img-container"}
          onClick={imageClickHandler}
        >
          {imageClicked ? (
            <></>
          ) : (
            <img
              className={"segmentation__image-zoom"}
              src={"./images/segmentation__images/zoom-circle.svg"}
              alt={"Увеличить"}
            />
          )}
          <img
            className="segmentation__mobile-img"
            alt="Распределение регионов по характеру образа в глазах туристов"
            src={imageSource}
            style={
              loading
                ? { opacity: 0.5, transition: "200ms ease-in-out" }
                : { transition: "200ms ease-in-out" }
            }
          />
        </div>
      </div>
      <SegmentationTitle color={"blue"} title_text={"Особые"} />
      <p className="segmentation__text">
        <b>Число отзывов выше среднего, преобладают положительные</b>
      </p>
      <p className="eval__text">
        К этой группе относятся всего 4 региона: Республика Хакасия, Республика
        Саха (Якутия), Удмуртская и Чеченская республики.
        <br />
        <br />
        Несмотря на позитивный образ, во всех регионах группы сравнительно
        низкий поток туристов. Эти регионы не воспринимаются путешественниками
        как важные туристические направления, но поездка сюда может приятно
        удивить посетителей.
        <br />
        <br />
        Большинство регионов группы — национальные республики, а значительную
        долю и от общего числа отзывов, и от числа позитивных комментариев
        составляют тексты о нематериальном наследии, то есть о культурной
        самобытности и уникальном местном колорите. Такой туристический опыт
        можно сравнить с посещением другой страны. Он позволяет совершить
        «перезагрузку» во время отдыха. Регионы этой группы могут раскрыть свой
        потенциал, и их образ может работать на увеличение турпотока.
      </p>
      <SegmentationTitle color={"orange"} title_text={"Известные"} />
      <p className="segmentation__text">
        <b>Число отзывов выше среднего, преобладают отрицательные</b>
      </p>
      <p className="eval__text">
        К этой группе относятся 15 регионов, в том числе многие популярные
        туристические направления. В группе представлено равное количество
        регионов с высоким и низким турпотоком.
        <br />
        <br />
        К первым относятся такие популярные у туристов регионы, как Республика
        Крым, Краснодарский и Алтайский край. Благодаря своим
        достопримечательностям и природным особенностям они привлекают внимание
        туристов. Однако они могут и разочаровать — в первую очередь, качеством
        туристической инфраструктуры, которая в большинстве из этих регионов
        собрала значительное количество негативных отзывов.
        <br />
        <br />
        В условиях пандемии большим преимуществом стало наличие теплого моря. Но
        чтобы остаться лидерами в будущем, когда российские туристы смогут
        отправиться на зарубежные пляжи, регионам необходимо улучшать качество
        обслуживания, мест размещения, транспорта, экскурсионных программ и
        сувенирной продукции.
        <br />
        <br />
        К регионам с низким турпотоком относятся, например, Камчатский край и
        республика Карелия. Дикая природа, привлекающая туристов в эти регионы,
        иногда накладывает свои ограничения на рост туристического потока:
        увеличение антропогенной нагрузки может нанести вред уникальным
        природным достопримечательностям, которые особенно интересны туристам.
        Но это не означает, что развитие туризма в таких регионах уже достигло
        своих предельных показателей. Можно повысить посещаемость регионов и
        увеличить доходы от туристической отрасли, разработав стратегии
        развития, основанные на комплексных экологических исследованиях. В них
        могут быть учтены как меры по повышению доступности природных
        достопримечательностей и туристических услуг, так и меры по снижению
        антропогенного воздействия на природный комплекс.
        <br />
        <br />В группе также много национальных республик, образ которых основан
        на нематериальном наследии. Среди них, например, Республика Коми,
        Чувашия и Марий-Эл. Они пока не смогли раскрыть свой потенциал, собрать
        позитивные отзывы и привлечь туристов.
      </p>
      <SegmentationTitle color={"green"} title_text={"Скромные"} />
      <p className="segmentation__text">
        <b>Число отзывов ниже среднего, преобладают положительные</b>
      </p>
      <p className="eval__text">
        К этой группе относятся 7 регионов, среди которых преобладают
        национальные республики, такие как Адыгея, Мордовия и Калмыкия. Все они
        отличаются низким турпотоком. Такие регионы не очень активно занимаются
        продвижением туристического продукта на рынке, но на тех туристов,
        которые решают их посетить, они, как правило, производят приятное
        впечатление. Секрет успеха для национальных республик так же, как и для
        регионов с сильным позитивным брендом, кроется в необычном культурном
        контексте, который создают традиции, обычаи, искусство коренных народов.
      </p>
      <SegmentationTitle color={"red"} title_text={"Малозаметные"} />
      <p className="segmentation__text">
        <b>Число отзывов ниже среднего, преобладают отрицательные</b>
      </p>
      <p className="eval__text">
        К этой группе относится наибольшее число регионов — 56 из 82, прошедших
        оценку по Индексу. Среди них — многие регионы европейской части России,
        где расположено больше всего объектов культурного наследия и где
        проживает большая часть населения страны. Эти регионы доступнее других
        для туристических поездок.
        <br />
        <br />
        23 региона группы, несмотря на низкую популярность в социальных медиа и
        скорее негативный образ, привлекают значительное количество туристов. К
        ним относятся, например, Владимирская, Иркутская, Калининградская,
        Нижегородская области. Здесь есть достопримечательности, которые
        интересны посетителям. Однако регионы не используют их для комплексного
        развития туризма, в результате чего популярностью пользуются только
        отдельные достопримечательности или территории. Например, много туристов
        приезжает в Суздаль, но город не ассоциируется у них с Владимирской
        областью. Популярность Суздаля не способствует продвижению других
        туристических направлений и населенных пунктов региона и,
        соответственно, росту доходов от туризма. Для развития туристической
        отрасли таким регионам необходимо работать над своим брендом и
        ассоциировать его с ключевыми достопримечательностями, а также
        формировать новые точки притяжения и маршруты, которые могли бы
        заинтересовать туристов, уже посетивших наиболее популярные места.
        <br />
        <br />
        33 региона группы отличаются низким турпотоком, несмотря на
        расположенные в них достопримечательности. К ним относятся, например,
        Вологодская, Ивановская, Костромская, Новгородская и Псковская области.
        <br />
        <br />
        Причина их низкой популярности в том, что среда и культура здесь мало
        отличаются от повседневной среды, окружающей большинство россиян,
        проживающих в европейской части России. В этих регионах не происходит
        заметная смена контекста и «перезагрузка», которая привлекает туристов в
        национальных республиках. Чтобы развивать туризм в регионах этой группы,
        необходимо переосмыслить подходы к продвижению туристического продукта и
        привлечь внимание новой аудитории к популярным историческим
        достопримечательностям.
      </p>
      <ButtonComponent />
    </article>
  )
}

export default SegmentationPower
